In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
import seaborn as sns
import matplotlib.pyplot as plt
from scipy.stats import norm
from sklearn.preprocessing import StandardScaler#normaliation
from scipy import stats
import warnings
warnings.filterwarnings('ignore')
%matplotlib inline

In [4]:
a=DataFrame([[1,2,3],[np.NaN,5,6],[7,np.NaN,8],[np.NaN,np.NaN,np.NaN]])
a

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  8.0
3  NaN  NaN  NaN

In [8]:
a.dropna()#the row get deleted

     0    1    2
0  1.0  2.0  3.0

In [9]:
a.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [10]:
a.dropna(how='all')#all values are null value

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  8.0

In [11]:
a.dropna(thresh=1)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  8.0

In [12]:
a.dropna(thresh=2)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  8.0

In [13]:
a.dropna(thresh=3)

     0    1    2
0  1.0  2.0  3.0

In [14]:
a.dropna(thresh=4)#it should have the4 element with it

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [17]:
# hierarchy index  calls the index value
a1=DataFrame(np.arange(16).reshape(4,4),index=[[1,1,2,2],['a','b','a','b']])
a1

      0   1   2   3
1 a   0   1   2   3
  b   4   5   6   7
2 a   8   9  10  11
  b  12  13  14  15

In [20]:
a1=DataFrame(np.arange(16).reshape(4,4),index=[[1,1,2,2],['a','b','a','b']],columns=[['bangr','nagpur','nagpur','nagpur'],['cold','hot','cold','rainy']])
a1

    bangr nagpur
     cold    hot cold rainy
1 a     0      1    2     3
  b     4      5    6     7
2 a     8      9   10    11
  b    12     13   14    15

In [21]:
a1['bangr']

     cold
1 a     0
  b     4
2 a     8
  b    12

In [22]:
a1['nagpur']

     hot  cold  rainy
1 a    1     2      3
  b    5     6      7
2 a    9    10     11
  b   13    14     15

In [23]:
a1['nagpur','rainy']

1  a     3
   b     7
2  a    11
   b    15
Name: (nagpur, rainy), dtype: int32

In [24]:
a1['nagpur','rainy'][1,'a']

3

In [25]:
a1['nagpur','rainy'][2]

a    11
b    15
Name: (nagpur, rainy), dtype: int32

In [38]:
s1=Series([1,2,3,4,np.nan],index=['a','b','c','d','e'])
s2=Series([3,np.nan,4,np.nan,np.nan],index=['a','b','c','d','e'])
print(s1)
print(s2)
s=s2.fillna(s1)
s
s3=Series(np.where(s2.isnull(),s1,s2),index=s1.index)
#s1.combine_first(s2)

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
dtype: float64
a    3.0
b    NaN
c    4.0
d    NaN
e    NaN
dtype: float64

a    3.0
b    2.0
c    4.0
d    4.0
e    NaN
dtype: float64

In [52]:
df=DataFrame({'keys1':['A','A','B','B','B'],'keys2':[2,2,2,3,3]})
df

  keys1  keys2
0     A      2
1     A      2
2     B      2
3     B      3
4     B      3

In [54]:
df.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [55]:
df.drop_duplicates()

  keys1  keys2
0     A      2
2     B      2
3     B      3

In [58]:
df.drop_duplicates(['keys1'],keep='last')

  keys1  keys2
1     A      2
4     B      3

In [48]:
df1=DataFrame({'names':['monika','anagha','malini'],'weight':[70,50,60]})
df1

    names  weight
0  monika      70
1  anagha      50
2  malini      60

In [49]:
height_map={'monika':50,'anagha':60,'malini':70}
height_map

{'monika': 50, 'anagha': 60, 'malini': 70}

In [50]:
df1['height']=df1['names'].map(height_map)
df1

    names  weight  height
0  monika      70      50
1  anagha      50      60
2  malini      60      70